import { createTranslation } from "@/utils/uktiUtils";
import type { Definition } from "../Definition";

export const translations_AR = createTranslation<Definition>({
  eyeOnGaza: "عين على غزة",
  aboutTitle: "حول هذه الميزة",
  aboutDescription:
    "كسر حاجز الصمت بالحقيقة والشفافية. نافذة مباشرة على واقع غزة، تقدم تغطية موثقة وغير منحازة للأحداث فور وقوعها.",
  followUs: "تابعونا",
  comingSoonTitle: "قريباً",
  comingSoonDescription:
    " نعمل على بناء منصة قوية لتوثيق ومشاركة واقع غزة. كل قصة مهمة، وكل صوت  له قيمة. انضموا إلينا في هذه المهمة لضمان وصول الحقيقة إلى كل ركن من  أركان العالم.",
  feature1: "تقديم تحديثات لحظية من مراسلين موثوقين على الأرض",
  feature2: "تقديم تغطية محققة وغير منحازة للأحداث في غزة",
  feature3: "تتبع والتحقق من الحوادث في الوقت الفعلي",
  feature4: "الحفاظ على قاعدة بيانات شاملة للأحداث وتأثيراتها",
  feature5: "تقديم تحليل مبني على البيانات للأوضاع الإنسانية",
  feature6: "تقديم أخبار موثقة من مصادر معتمدة",
  feature7: "تضمين خرائط تفاعلية وتصورات بصرية للأحداث",
  feature8: "عرض شهادات وروايات موثقة من الميدان",
  expectTitle: "ما يمكن توقعه",
  expectDescription:
    "تهدف هذه المنصة إلى أن تكون مصدرك الموثوق لفهم الوضع في غزة، مع ضمان توثيق كل قصة، وتسجيل كل حدث، وسماع كل صوت. من خلال تجميع المعلومات الموثقة والتقارير الموثوقة، ستقف 'عين على غزة' شاهداً على الحقيقة والشفافية في الصحافة.",
  comingSoonBadge: "قيد التطوير",
});
